src/CF/Documents/ДвиженияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ДвиженияДенег</Name>
			<BasedOn>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.РасходыТовара</xr:Item>
				<xr:Item>Document.Инвентаризации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСОтсрочкой</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.Расчеты</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиСОтсрочкой</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВНесколькоСтрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПриход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходыТовара</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступленияТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеИВыплатаЗаработнойПлаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменВалют</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходДенег</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенегОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриходИлиРасход</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПриходРасход</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДенег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходыТовара</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступленияТовара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлиентПоставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДенег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CF/Documents/ДвиженияДенег/Forms/ФормаСписка/Ext/Form/Module.bsl
//sza140509-0111 SZA: 
//sza130901-2345 :

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	текущийОстаток = ОбновитьТекущийОстаток(ОтборПоХранилищуДенег);
	Элементы.НаименованиеОсновнойВалюты.Видимость = НЕ текущийОстаток = 0;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция   ОбновитьТекущийОстаток(ОтборПоХранилищуДенег) 
	
	ТекущийОстаток = 0;
	
	ДатаОстатка = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	
	Возврат ОбщийМодульСервер.ОстатокДенег(ДатаОстатка, , , ?(ЗначениеЗаполнено(ОтборПоХранилищуДенег), ОтборПоХранилищуДенег, Неопределено));
	
КонецФункции //ОбновитьТекущийОстаток

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                       // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	текущийОстаток = ОбновитьТекущийОстаток(ОтборПоХранилищуДенег);
	Элементы.НаименованиеОсновнойВалюты.Видимость = НЕ текущийОстаток = 0;
	ОтборПоОрганизацииПриИзмененииНаСервере(Истина);
	ОтборПоХранилищуДенегПриИзмененииНаСервере();
	ПрименитьВидФормыСписка();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	текущийОстаток = ОбновитьТекущийОстаток(ОтборПоХранилищуДенег);
	Элементы.НаименованиеОсновнойВалюты.Видимость = НЕ текущийОстаток = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаток(Команда)
	
	текущийОстаток = ОбновитьТекущийОстаток(ОтборПоХранилищуДенег);
	Элементы.НаименованиеОсновнойВалюты.Видимость = НЕ текущийОстаток = 0;
	этаформа.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ	
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000890", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		НаименованиеОсновнойВалюты = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").Наименование ;
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(СписокВОднуКолонку);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Расходы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	текущийОстаток = ОбновитьТекущийОстаток(ОтборПоХранилищуДенег);
	Элементы.НаименованиеОсновнойВалюты.Видимость = НЕ текущийОстаток = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	текущийОстаток = ОбновитьТекущийОстаток(ОтборПоХранилищуДенег);
	Элементы.НаименованиеОсновнойВалюты.Видимость = НЕ текущийОстаток = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасход(Команда)
	
	СсылкаНаДокумент = СоздатьНовыйДокументРасход();
    ОткрытьЗначение(СсылкаНаДокумент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция   СоздатьНовыйДокументРасход()
	
   НовыйДокумент = Документы.ДвиженияДенег.СоздатьДокумент();
   НовыйДокумент.Дата 			= ОбщийМодульСервисСервер.ПользователяТекущаяДата();
   НовыйДокумент.ПриходДенег 	= Ложь;
   НовыйДокумент.Записать();
   
   Возврат НовыйДокумент.Ссылка;
   
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоВалютам(Команда)
	
	ФормаВалют = ПолучитьФорму("Справочник.Валюты.ФормаСписка");
	ФормаВалют.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасходПриходДокументОбменаВалют(Команда)
	
	СсылкаНаДокумент = СоздатьНовыйДокументОбмен();
    ОткрытьЗначение(СсылкаНаДокумент);
	
КонецПроцедуры

&НаСервере
Функция   СоздатьНовыйДокументОбмен()
	
   НовыйДокумент = Документы.ДвиженияДенег.СоздатьДокумент();
   НовыйДокумент.Дата 		= ОбщийМодульСервисСервер.ПользователяТекущаяДата();
   НовыйДокумент.ОбменВалют = Истина;
   НовыйДокумент.Записать();
   
   Возврат НовыйДокумент.Ссылка;
   
КонецФункции

&НаКлиенте
Процедура Деньги(Команда)
	
	ФормаОстатоков = ПолучитьФорму("ОбщаяФорма.Деньги");
	ФормаОстатоков.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументНачисленияИВыдачиЗаработнойПлаты(Команда)
	
	ПараметрыФормы = Новый Структура("РасчетЗП", Истина);
	ФормаНовогоДокумента = ПолучитьФорму("Документ.ДвиженияДенег.ФормаОбъекта", ПараметрыФормы);
	ФормаНовогоДокумента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	ОтборПоОрганизацииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоОрганизацииПриИзмененииНаСервере(НеОбновлятьВЭтотРаз = Ложь)
	
	Если параметрысеанса.ВестиУчетСобственныхЮридическихЛицПС Тогда
		Список.Параметры.УстановитьЗначениеПараметра("НетОтбораПоОрганизации", НЕ ЗначениеЗаполнено(ОтборПоОрганизации));
		Расходы.Параметры.УстановитьЗначениеПараметра("НетОтбораПоОрганизации", НЕ ЗначениеЗаполнено(ОтборПоОрганизации));
		СписокВОднуКолонку.Параметры.УстановитьЗначениеПараметра("НетОтбораПоОрганизации", НЕ ЗначениеЗаполнено(ОтборПоОрганизации));
		
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("НетОтбораПоОрганизации", Истина);
		расходы.Параметры.УстановитьЗначениеПараметра("НетОтбораПоОрганизации", Истина);
		СписокВОднуКолонку.Параметры.УстановитьЗначениеПараметра("НетОтбораПоОрганизации", Истина);		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("организация", ОтборПоОрганизации);
	расходы.Параметры.УстановитьЗначениеПараметра("организация", ОтборПоОрганизации);
	СписокВОднуКолонку.Параметры.УстановитьЗначениеПараметра("организация", ОтборПоОрганизации);
	
	Если НЕ НеОбновлятьВЭтотРаз Тогда
		Если РежимВидаОкнаВОдинСписок Тогда
			Элементы.СписокВОднуКолонку.Обновить();
		Иначе
			Элементы.Расходы.Обновить();
			Элементы.Список.Обновить();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьВидФормыСписка(Команда)
	
	РежимВидаОкнаВОдинСписок = НЕ РежимВидаОкнаВОдинСписок;
	элементы.ГруппаГоризонт.Видимость 		= не РежимВидаОкнаВОдинСписок;
	элементы.ГруппаВОдинСписок.Видимость 	= РежимВидаОкнаВОдинСписок;
	элементы.ГруппаКоманд.Видимость 		= не РежимВидаОкнаВОдинСписок;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьВидФормыСписка()
	
	элементы.ГруппаГоризонт.Видимость 		= не РежимВидаОкнаВОдинСписок;
	элементы.ГруппаВОдинСписок.Видимость 	= РежимВидаОкнаВОдинСписок;
	элементы.ГруппаКоманд.Видимость 		= не РежимВидаОкнаВОдинСписок;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоХранилищуДенегПриИзменении(Элемент)
	
	ОтборПоХранилищуДенегПриИзмененииНаСервере();
	текущийОстаток = ОбновитьТекущийОстаток(ОтборПоХранилищуДенег);
	
КонецПроцедуры

&НаСервере
Процедура ОтборПоХранилищуДенегПриИзмененииНаСервере()
	
	Если параметрысеанса.ВестиУчетСобственныхЮридическихЛицПС Тогда
		Список.Параметры.УстановитьЗначениеПараметра("НетОтбораПоХранилищу", НЕ ЗначениеЗаполнено(ОтборПоХранилищуДенег));
		Расходы.Параметры.УстановитьЗначениеПараметра("НетОтбораПоХранилищу", НЕ ЗначениеЗаполнено(ОтборПоХранилищуДенег));
		СписокВОднуКолонку.Параметры.УстановитьЗначениеПараметра("НетОтбораПоХранилищу", НЕ ЗначениеЗаполнено(ОтборПоХранилищуДенег));
		
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("НетОтбораПоХранилищу", Истина);
		расходы.Параметры.УстановитьЗначениеПараметра("НетОтбораПоХранилищу", Истина);
		СписокВОднуКолонку.Параметры.УстановитьЗначениеПараметра("НетОтбораПоХранилищу", Истина);		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ХранилищеДенег", ОтборПоХранилищуДенег);
	расходы.Параметры.УстановитьЗначениеПараметра("ХранилищеДенег", ОтборПоХранилищуДенег);
	СписокВОднуКолонку.Параметры.УстановитьЗначениеПараметра("ХранилищеДенег", ОтборПоХранилищуДенег);
	
	Если РежимВидаОкнаВОдинСписок Тогда
		Элементы.СписокВОднуКолонку.Обновить();
	Иначе
		Элементы.Расходы.Обновить();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры
